Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Bottom Layer (below Active Screen, transparent, not scroll-able, but click-able)
it_it: Layer Inferiore (sotto lo Schermo Attivo, trasparente, non scorrevole, ma cliccabile)

source: Box Shadow Draw Descriptor
it_it: Descrittore di Disegno del Riquadro dell'Ombra

source: Box model in LVGL
it_it: Modello Box in LVGL

source: Boxing Model
it_it: Modello di Boxing

source: Branches
it_it: Branch

source: Brightness
it_it: Luminosità

source: Buffer address must be aligned to 64 bytes: set :c:macro:`LV_DRAW_BUF_ALIGN` to `64` in "lv_conf.h".
it_it: L'indirizzo del buffer deve essere allineato a 64 byte: impostare :c:macro:`LV_DRAW_BUF_ALIGN` a `64` in "lv_conf.h".

source: Buffer configuration: Set the value of :c:macro:`LV_PROFILER_BUILTIN_BUF_SIZE` to configure the buffer size.
it_it: Configurazione del buffer: Impostare il valore di :c:macro:`LV_PROFILER_BUILTIN_BUF_SIZE` per configurare la dimensione del buffer.

source: Buffer swapping can be activated by passing a second buffer of same size instead of the :cpp:expr:`NULL` argument.
it_it: Lo swapping del buffer può essere attivato passando un secondo buffer della stessa dimensione al posto dell'argomento :cpp:expr:`NULL`.

source: Buffered Reading
it_it: Lettura Bufferizzata

source: Buffers will be allocated using GBM.
it_it: I buffer verranno allocati tramite GBM.

source: Bug fixes: released on demand even weekly
it_it: Correzioni di bug: rilasciate su richiesta, anche settimanalmente

source: Bug reports
it_it: Segnalazioni di bug

source: Build Host Packages
it_it: Pacchetti Host di Build

source: Build LVGL as a Library
it_it: Compilare LVGL come libreria

source: Build System
it_it: Sistema di Build

source: Build System Support
it_it: Supporto del Sistema di Build

source: Build a base image
it_it: Creare un'immagine di base

source: Build for RaspberryPi3 64
it_it: Build per RaspberryPi3 64

source: Build public APIs, plugins, converters, or SDKs based on this Specification.
it_it: Creare API, plugin, convertitori o SDK pubblici basati su questa Specifica.

source: Build the Application
it_it: Building dell'Applicazione

source: Build the application
it_it: Build dell'applicazione

source: Build the image
it_it: Creare l'immagine

source: Build the lottie animation for the intended frame rate.
it_it: Creare l'animazione lottie per il frame rate desiderato.

source: Build the lottie animation to be sized for the intended size.
it_it: Creare l'animazione lottie in modo che abbia le dimensioni desiderate.

source: Build the project by pressing ``Ctrl`` + ``Alt`` + ``B``
it_it: Compilare il progetto premendo ``Ctrl`` + ``Alt`` + ``B``

source: Build the recipe
it_it: Compilare la ricetta

source: Build with CMake GUI
it_it: Compilazione con la GUI di CMake

source: Build with Command line
it_it: Compilazione da riga di comando

source: Build with IDE
it_it: Compilazione con IDE

source: Build with cmake presets
it_it: Compilazione con i preset di CMake

source: Building LVGL
it_it: Compilazione di LVGL

source: Building Rlottie
it_it: Compilazione di Rlottie

source: Building an IDF project that features the LVGL usage, is similar to any other project, by using IDF through the command line the user can combine various commands into a single prompt:
it_it: Compilare un progetto IDF che prevede l'utilizzo di LVGL è simile a qualsiasi altro progetto: utilizzando IDF tramite la riga di comando, l'utente può combinare diversi comandi in un unico prompt:

source: Building and Flashing
it_it: Compilazione e Flashing

source: Building the Wayland Driver
it_it: Building del Driver Wayland

source: Building the application consists of compiling the source with the LVGL headers, and then linking against the library.
it_it: Il building dell'applicazione consiste nel compilare il codice sorgente con gli header LVGL e poi nel linkarlo alla libreria.

source: Building the documentation is easy.
it_it: Il "building" [creazione] della documentazione è semplice.

source: Building this list (and initializing the Draw Units) is normally handled automatically by configuring the available Draw Units in ``lv_conf.h``, such as setting :c:macro:`LV_USE_DRAW_OPENGLES` or :c:macro:`LV_USE_PXP` or :c:macro:`LV_USE_DRAW_SDL` or :c:macro:`LV_USE_DRAW_VG_LITE` to ``1``.
it_it: La creazione di questo elenco (e l'inizializzazione delle Draw Unit) viene normalmente gestita automaticamente configurando le Draw Unit disponibili in ``lv_conf.h``, ad esempio impostando :c:macro:`LV_USE_DRAW_OPENGLES` o :c:macro:`LV_USE_PXP` o :c:macro:`LV_USE_DRAW_SDL` o :c:macro:`LV_USE_DRAW_VG_LITE` a ``1``.

source: Buildroot is a set of Makefiles and patches that simplifies and automates the process of building a complete and bootable Linux environment for an embedded system, while using cross-compilation to allow building for multiple target platforms on a single Linux-based development system.
it_it: Buildroot è un set di Makefile e patch che semplifica e automatizza il processo di creazione di un ambiente Linux completo e avviabile per un sistema embedded, utilizzando al contempo la cross-compilazione per consentire la creazione per più piattaforme target su un singolo sistema di sviluppo basato su Linux.

source: Built-In Fonts
it_it: Font Integrati

source: Built-In Image Decoders
it_it: Decoder di Immagini Nativi

source: Built-In Input and Output Formats
it_it: Formati di Input e Output Nativi

source: Built-In Layouts
it_it: Layout Nativi

source: Built-in Drivers
it_it: Driver Nativi

source: Built-in Input Color Formats
it_it: Input di Formati Colore Nativi

source: Built-in Widgets
it_it: Widgets Nativi

source: Built-in colors
it_it: Colori predefiniti

source: Built-in themes can be extended.
it_it: I temi nativi possono essere estesi.

source: Built-in widgets are registered automatically.
it_it: I widget nativi vengono registrati automaticamente.

source: Bulleted Lists
it_it: Elenchi Puntati

source: But :ref:`Encoders <indev_encoder>` have a limited number of "keys", making it difficult to navigate and adjust widgets.
it_it: Tuttavia, gli :ref:`Encoder <indev_encoder>` hanno un numero limitato di "tasti", rendendo difficile la navigazione e la regolazione dei widget.

source: But an :ref:`lv_image` Widget can also be used to create a image as a wallpaper background for the Widget Tree.
it_it: Ma è possibile utilizzare anche un Widget :ref:`lv_image` per creare un'immagine come sfondo per il "Widget Tree".

source: But because it is --- at its core --- a generic change-over-time manager, complete with a variety of optional event callbacks, its application can be wider than just to UI components.
it_it: Ma poiché è --- in sostanza --- un gestore generico di modifiche nel tempo, completo di una varietà di callback di eventi opzionali, la sua applicazione può essere più ampia rispetto ai soli componenti dell'UI.

source: But for widgets where a short click has meaning (e.g., a :ref:`Button <lv_button>`), a long press is required.
it_it: Ma per i widget in cui un clic breve ha un significato (ad esempio, un :ref:`Button <lv_button>`), è richiesta una pressione prolungata.

source: But if you add this line, it will:
it_it: Ma se si aggiunge questa riga, si otterrà:

source: But in MicroPython we need to register a *MicroPython callable object* for each callback.
it_it: In MicroPython, invece, dobbiamo registrare un *oggetto richiamabile MicroPython* per ogni callback.

source: But in some cases the *rate* is known but the duration is not known.
it_it: In alcuni casi, tuttavia, la *velocità* è nota, ma la durata non lo è.

source: But newer versions don't.
it_it: Ma le versioni più recenti non lo richiedono.

source: But you can provide your own "set" functions, and so the application of Animations is really limited only by your imagination.
it_it: Ma è possibile fornire le proprie funzioni "set", quindi l'applicazione delle Animazioni è limitata solo dall'immaginazione.

source: But, the *System Layer* is intended for system-level things (e.g. mouse cursor will be placed there with :cpp:func:`lv_indev_set_cursor`).
it_it: Il *Layer di Sistema*, invece, è destinato a funzioni a livello di sistema (ad esempio, il cursore del mouse verrà posizionato lì con :cpp:func:`lv_indev_set_cursor`).

source: Button
it_it: Pulsante

source: Button (lv_button)
it_it: Pulsante (lv_button)

source: Button Matrix
it_it: Matrice di Pulsanti

source: Button Matrix (lv_buttonmatrix)
it_it: Matrice di Pulsanti (lv_buttonmatrix)

source: Button behavior
it_it: Comportamento dei pulsanti

source: Button click event
it_it: Evento clic pulsante

source: Button map
it_it: Mappa dei pulsanti

source: Button matrix control flags are set to differentiate the buttons and a custom drawer event is added to modify the properties of the buttons as follows:
it_it: I flag di controllo del "Button matrix" sono impostati per differenziare i pulsanti e viene aggiunto un evento personalizzato per modificare le proprietà dei pulsanti come segue:

source: Button monkey example
it_it: Esempio di "button monkey"

source: Button widths
it_it: Larghezza dei pulsanti

source: Buttons
it_it: Pulsanti

source: Buttons as Encoder
it_it: Pulsanti come Encoder

source: Buttons can also be added to the header if desired with :cpp:expr:`lv_msgbox_add_header_button(msgbox, symbol)`.
it_it: È anche possibile aggiungere pulsanti all'intestazione con :cpp:expr:`lv_msgbox_add_header_button(msgbox, symbol)`.

source: Buttons have no new features compared to the :ref:`base_widget`.
it_it: I "Button" [pulsanti] non presentano nuove funzionalità rispetto al :ref:`base_widget`.

source: Buttons on the header: :ref:`lv_button`
it_it: Pulsanti sull'intestazione: :ref:`lv_button`

source: Buttons so added are added to the right end of the header.
it_it: I pulsanti aggiunti in questo modo vengono aggiunti all'estremità destra dell'intestazione.

source: Buttons, by default, differ from the Base Widget in the following ways:
it_it: I pulsanti, per default, differiscono dal Widget Base nei seguenti modi:

source: Buttons: :ref:`lv_button`
it_it: Pulsanti: :ref:`lv_button`

source: By adding properties to the ``<view>``, the extended type can be customized.
it_it: Aggiungendo proprietà a ``<view>``, è possibile personalizzare il tipo esteso.

source: By calling :cpp:expr:`lv_obj_null_on_delete(&widget)`, the ``lv_obj_t *`` variable of the widget will be set to NULL when the widget is deleted.
it_it: Chiamando :cpp:expr:`lv_obj_null_on_delete(&widget)`, la variabile ``lv_obj_t *`` del widget verrà impostata su NULL quando il widget viene eliminato.

source: By calling :cpp:expr:`lv_test_display_create(hor_res, ver_res)`, a dummy display can be created.
it_it: Chiamando :cpp:expr:`lv_test_display_create(hor_res, ver_res)`, è possibile creare un display fittizio.

source: By calling :cpp:func:`lv_test_indev_create_all`, three test input devices will be created:
it_it: Chiamando :cpp:func:`lv_test_indev_create_all`, verranno creati tre dispositivi di input di test:

source: By contributing to any repositories of the LVGL project you agree that your contribution complies with the DCO.
it_it: Contribuendo a qualsiasi repository del progetto LVGL, si accetta che il contributo sia conforme al DCO.

source: By convention, layers in the Yocto Project follow a specific form.
it_it: Per convenzione, i layer nel Progetto Yocto seguono una forma specifica.

source: By default :cpp:enumerator:`LV_OBJ_FLAG_ADV_HITTEST` is disabled which means the Arc's whole area is interactive.
it_it: Per default :cpp:enumerator:`LV_OBJ_FLAG_ADV_HITTEST` è disabilitato, il che significa che l'intera area dell'Arco è interattiva.

source: By default a local container registry uses clear text HTTP so the Docker instance running on the device has to be configured to allow fetching images from an 'insecure' repository.
it_it: Per default un "container registry" locale utilizza HTTP in chiaro, quindi l'istanza Docker in esecuzione sul dispositivo deve essere configurata per consentire il recupero di immagini da un repository 'non sicuro'.

source: By default it is running infinitely at 60FPS however the LVGL animation can be freely adjusted.
it_it: Per default, l'animazione gira all'infinito a 60 FPS, tuttavia l'animazione LVGL può essere regolata liberamente.

source: By default it runs in current source directory **${S}**.
it_it: Per default viene eseguito nella directory sorgente corrente **${S}**.

source: By default the image Widget's width and height are :cpp:enumerator:`LV_SIZE_CONTENT`, meaning that the Widget will be sized automatically to the size of its image source.
it_it: Per default, la larghezza e l'altezza del Widget "image" sono :cpp:enumerator:`LV_SIZE_CONTENT`, il che significa che il widget verrà ridimensionato automaticamente in base alle dimensioni dell'immagine sorgente.

source: By default, :cpp:enumerator:`LV_BARCODE_ENCODING_CODE128_GS1` encoding is used and strips ``[FCN1]`` and spaces.
it_it: Per default, viene utilizzata la codifica :cpp:enumerator:`LV_BARCODE_ENCODING_CODE128_GS1`, che elimina ``[FCN1]`` e gli spazi.

source: By default, Arc Label is not clickable.
it_it: Per default, Arc Label non è cliccabile.

source: By default, Docker containers are isolated from the hardware of the host system.
it_it: Per default, i container Docker sono isolati dall'hardware del sistema host.

source: By default, Git repositories are cloned to ${WORKDIR}/git during do_fetch.
it_it: Per default, i repository Git vengono clonati in ${WORKDIR}/git durante il do_fetch.

source: By default, Image Widgets are created without the LV_OBJ_FLAG_CLICKABLE flag, but you can add it to make an Image Widget detect and emit LV_EVENT_CLICKED events if desired.
it_it: Per default, i Widget Image vengono creati senza il flag LV_OBJ_FLAG_CLICKABLE, ma è possibile aggiungerlo per far sì che un Widget Image rilevi ed emetta eventi LV_EVENT_CLICKED.

source: By default, LVGL calls ``read_cb`` periodically.
it_it: Per default, LVGL chiama ``read_cb`` periodicamente.

source: By default, LVGL draws new Widgets on top of old Widgets.
it_it: Per default, LVGL disegna i nuovi Widget sopra i vecchi Widget.

source: By default, LVGL itself uses Timers to:
it_it: Per default, LVGL utilizza i Timer per:

source: By default, LVGL relies on the ``xdg-shell`` protocol for window management to generate it run the following commands:
it_it: Per default, LVGL si basa sul protocollo ``xdg-shell`` per la gestione delle finestre. Per generarli, eseguire i seguenti comandi:

source: By default, LVGL will select a preferred display mode.
it_it: Per default, LVGL selezionerà una modalità di visualizzazione preferita.

source: By default, Label Widgets are created without the LV_OBJ_FLAG_CLICKABLE flag, but you can add it to make a Label Widget emit LV_EVENT_CLICKED events if desired.
it_it: Per default, i Widget Label vengono creati senza il flag LV_OBJ_FLAG_CLICKABLE, ma è possibile aggiungerlo per far sì che emetta eventi LV_EVENT_CLICKED.

source: By default, ``lv_port_linux`` is configured to use the legacy framebuffer device ``/dev/fb0``.
it_it: Per default, ``lv_port_linux`` è configurato per utilizzare il dispositivo framebuffer legacy ``/dev/fb0``.

source: By default, a :ref:`timer` is created that calls the ``read_cb`` periodically.
it_it: Per default, viene creato un :ref:`timer` che chiama periodicamente ``read_cb``.

source: By default, a Switch is oriented horizontally.
it_it: Per default, uno Switch è orientato orizzontalmente.

source: By default, a Widget's children are not added to the grid.
it_it: Per default, gli elementi figlio di un Widget non vengono aggiunti alla grid.

source: By default, a font will cache data for up to 256 glyph elements to speed up rendering.
it_it: Per default, un font memorizza nella cache i dati per un massimo di 256 elementi glifo per velocizzare il rendering.

source: By default, any time that DMA2D is working on a draw task that LVGL depends on the completion of before continuing, LVGL will spin waiting for DMA2D to complete.
it_it: Per default, ogni volta che DMA2D sta lavorando a un task di disegno dal cui completamento LVGL dipende prima di continuare, LVGL si metterà in attesa del completamento di DMA2D.

source: By default, draw units use :c:macro:`LV_THREAD_PRIO_HIGH` as their thread priority.
it_it: Per default, le draw unit utilizzano :c:macro:`LV_THREAD_PRIO_HIGH` come priorità dei thread.

source: By default, each glTF viewer automatically creates an environment using an embedded default image with a cube map resolution of 128.
it_it: Per default, ogni viewer glTF crea automaticamente un ambiente utilizzando un'immagine predefinita embedded con una risoluzione della mappa cubica di 128.

source: By default, esp_lvgl_port depends on the latest stable version of LVGL, so no additional steps are needed for new projects.
it_it: Per default, esp_lvgl_port dipende dall'ultima versione stabile di LVGL, quindi non sono necessari passaggi aggiuntivi per i nuovi progetti.

source: By default, if the ``•`` (`Bullet, U+2022 <http://www.fileformat.info/info/unicode/char/2022/index.htm>`__) character exists in the font, the entered characters are converted to it after a configurable delay after each new character is entered.
it_it: Per default, se il carattere ``•`` (`Bullet, U+2022 <http://www.fileformat.info/info/unicode/char/2022/index.htm>`__) è presente nel font, i caratteri immessi vengono convertiti in tale carattere dopo un ritardo configurabile dopo ogni nuovo carattere immesso.

source: By default, it is disabled.
it_it: Per default, è disabilitato.

source: By default, its size is equal to the height of the main part's font.
it_it: Per default, la sua dimensione è pari all'altezza del font della parte "main".

source: By default, most widgets send gestures to their parents so they can be detected on the Screen widget in the form of an :cpp:enumerator:`LV_EVENT_GESTURE` event.
it_it: Per default, la maggior parte dei widget invia i gesti ai widget principali in modo che possano essere rilevati sul widget Screen sotto forma di un evento :cpp:enumerator:`LV_EVENT_GESTURE`.

source: By default, no Widget or Screen is created.
it_it: Per default, non viene creato alcun Widget o Screen.

source: By default, once the Timer has run ``count`` times, it will be automatically deleted.
it_it: Per default, una volta che il timer è stato eseguito ``count`` volte, verrà automaticamente eliminato.

source: By default, the *y == 0* point is at the top of the Widget.
it_it: Per default, il punto *y == 0* si trova nella parte superiore del Widget.

source: By default, the DRM driver automatically selects the preferred display mode for the connected display.
it_it: Per default, il driver DRM seleziona automaticamente la modalità di visualizzazione preferita per il display connesso.

source: By default, the FreeType extension doesn't use LVGL's file system.
it_it: Per default, l'estensione FreeType non utilizza il file system di LVGL.

source: By default, the Line's width and height are set to :c:macro:`LV_SIZE_CONTENT`.
it_it: Per default, la larghezza e l'altezza della Linea sono impostate su :c:macro:`LV_SIZE_CONTENT`.

source: By default, the TTF or OTF file must be embedded as an array, either in a header, or loaded into RAM in order to function.
it_it: Per default, il file TTF o OTF deve essere incorporato come array, in un header o caricato nella RAM per funzionare.

source: By default, the blit split threshold is set to 352.
it_it: Per default, la soglia del "blit split" è impostata su 352.

source: By default, the knob is round (radius-style can modify this) with diameter slightly smaller than the smaller side of the slider.
it_it: Per default, la manopola è rotonda (lo stile del raggio può modificarlo) con un diametro leggermente inferiore al lato più piccolo dello slider.

source: By default, the knob is round (radius-style can modify this) with side length equal to the smaller dimension of the Slider.
it_it: Per default, la manopola è rotonda (lo stile del raggio può modificarlo) con una lunghezza del lato pari alla dimensione minore dello Slider.

source: By default, the labels shown are the numeric values of the scale at the major tick points.
it_it: Per default, le etichette mostrate sono i valori numerici della scala nei punti delle tacche maggiori.

source: By default, the pivot point of the rotation is the center of the image.
it_it: Per default il punto di rotazione è il centro dell'immagine.

source: By default, the width and height of the Label are set to :c:macro:`LV_SIZE_CONTENT`.
it_it: Per default, la larghezza e l'altezza dell'etichetta sono impostate su :c:macro:`LV_SIZE_CONTENT`.

source: By default, these flags are disabled.
it_it: Per default, questi flag sono disabilitati.

source: By default, this directory is ${WORKDIR}/${BPN}-${PV}, where ${BPN} is the base recipe name and ${PV} is the recipe version.
it_it: Per default, questa directory è ${WORKDIR}/${BPN}-${PV}, dove ${BPN} è il nome della ricetta di base e ${PV} è la versione della ricetta.

source: By default, this directory is the same as the S directory, which is defined as:
it_it: Per default, questa directory è la stessa della directory S, definita come:

source: By default, this feature of LVGL is turned off.
it_it: Per default, questa funzionalità di LVGL è disattivata.

source: By default, this is initialized to :cpp:func:`lv_tick_get` just before invoking ``read_cb``.
it_it: Per default, viene inizializzato su :cpp:func:`lv_tick_get` subito prima di richiamare ``read_cb``.

source: By default, when a Widget changes state (e.g. it's pressed) the new properties from the new state are set immediately.
it_it: Per default, quando un Widget cambia stato (ad esempio, quando viene premuto), le nuove proprietà del nuovo stato vengono impostate immediatamente.

source: By default, widgets can be clicked only within their bounding area.
it_it: Per default, i widget possono essere cliccati solo all'interno della loro area di "bounding" [delimitazione].

source: By licensing their processor designs, Arm enables a broad ecosystem of partners to develop customized solutions optimized for performance, power, and size.
it_it: Concedendo in licenza i propri progetti di processori, Arm consente a un ampio ecosistema di partner di sviluppare soluzioni personalizzate ottimizzate per prestazioni, consumo energetico e dimensioni.

source: By pressing the corresponding number key (9-0), you can navigate directly to the option.
it_it: Premendo il tasto numerico corrispondente (9-0), è possibile accedere direttamente all'opzione.

source: By this mechanism, all widgets carry the features of the Base Widget.
it_it: Con questo meccanismo, tutti i widget possiedono le funzionalità del Widget Base.

source: By turning the encoder, you can focus on the next or previous object.
it_it: Ruotando l'encoder, è possibile mettere il focus sull'oggetto successivo o precedente.

source: By using ``lv_obj_add_subject_...()`` it's also possible to change a subject's value on a trigger.
it_it: Utilizzando ``lv_obj_add_subject_...()`` è anche possibile modificare il valore di un Subject su un trigger.

source: By using :cpp:expr:`lv_dpx(n)`, the values are scaled based on the DPI of the display to make the result independent of pixel density.
it_it: Utilizzando :cpp:expr:`lv_dpx(n)`, i valori vengono ridimensionati in base ai DPI del display per rendere il risultato indipendente dalla densità di pixel.

source: By using :cpp:expr:`lv_obj_bind_style_prop`, it's possible to bind a style property to a :ref:`Subject <observer_overview>`\ 's value.
it_it: Utilizzando :cpp:expr:`lv_obj_bind_style_prop`, è possibile associare una proprietà di stile al valore di :ref:`Subject <observer_overview>`\ 's value.
